config/doom/config-personal.org
#+title: Emacs Config: Personal
#+author: Cash Weaver
#+email: cashbweaver@gmail.com

This is my Emacs configuration file; written in [[https://orgmode.org][=org-mode=]] in literate programming style and based heavily on the work of others[fn:1].

* General
** User Information

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 user-full-name "Cash Weaver"
 user-mail-address "cashbweaver@gmail.com")
#+end_src

** Date and Time

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 ;; Use YYYY-MM-DD date format.
 calendar-date-style 'iso)
#+end_src

*** Helper Functions

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/format-time (&optional time-format offset-days)
  "Return the (offset) date in format."
  (interactive)
  (let* ((time-format
         (or time-format
             "%Y-%m-%d"))
        (offset-days
         (if offset-days
             offset-days
           0))
        (time
         (cond
          ((= offset-days
              0)
           (current-time))
          (t
           (time-add
            (current-time)
            (days-to-time offset-days))))))
    (format-time-string
     time-format
     time)))

(defun cashweaver/todays-date ()
  "Return todays date as YYYY-MM-DD."
  (cashweaver/format-time
   "%Y-%m-%d"
   ;; offset-days
   0))

(defun cashweaver/yesterdays-date ()
  "Return yesterday's date as YYYY-MM-DD."
  (cashweaver/format-time
   "%Y-%m-%d"
   ;; offset-days
   -1))
#+end_src

** Packages
*** =free-keys=

Show free bindings in current buffer.

**** Package
#+begin_src emacs-lisp :tangle packages-personal.el
(package! free-keys
  :recipe (:host github
           :repo "Fuco1/free-keys"))
#+end_src

**** Config

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! free-keys)
#+end_src

*** =command-log-mode=

For showing which keys I'm pressing during screencasts, presentations, or pairing sessions.

Alternatives include:

- [[https://gitlab.com/screenkey/screenkey][screenkey]]: "A screencast tool to display your keys inspired by Screenflick"

**** Package

#+begin_src emacs-lisp :tangle packages-personal.el
(package! command-log-mode)
#+end_src

**** Config

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! command-log-mode
  :config
  (setq
   command-log-mode-open-log-turns-on-mode t
   command-log-mode-window-size 80
   command-log-mode-is-global t))
#+end_src

**** Usage

#+begin_src emacs-lisp
;; Enable the global mode
(global-command-log-mode)

;; Toggle the log buffer
(clm/toggle-command-log-buffer)
#+end_src
** TODO Notifications

*** =alert=
**** Package

Doom Emacs provides =alert=.

**** Config

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 alert-fade-time 60
 alert-default-style 'libnotify)
#+end_src

*** =org-wild-notifier=
**** Package

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-wild-notifier)
#+end_src

**** Config

#+begin_src emacs-lisp :tangle config-personal.el
;; Too early load error
(use-package! org-wild-notifier
  :config
  (setq
   org-wild-notifier-alert-time '(2))
  (org-wild-notifier-mode))
#+end_src

** Keybindings
*** Helper Methods

#+begin_src emacs-lisp :tangle config-personal.el
; Reference; https://www.emacswiki.org/emacs/DocumentingKeyBindingToLambda
(defun evil-lambda-key (mode keymap key def)
  "Wrap `evil-define-key' to provide documentation."
  (set 'sym (make-symbol (documentation def)))
  (fset sym def)
  (evil-define-key mode keymap key sym))
#+end_src

*** General / Global

#+begin_src emacs-lisp :tangle config-personal.el
(map!
 ;; Keep in alphabetical order.
 (:leader
  :desc "at point" :n "h h" #'helpful-at-point
  :desc "Langtool" :n "t L" #'langtool-check
  (:prefix ("n")
   :desc "Store email link" :n "L" #'org-notmuch-store-link
   (:prefix ("A" . "Anki")
    :n "d" #'anki-editor-delete-notes
    :n "c" #'anki-editor-cloze-dwim
    :n "i" #'anki-editor-insert-note)
   (:prefix ("r")
    :n "C" #'cashweaver/org-roam-node-from-cite))
  (:prefix ("p")
   :n "u" #'cashweaver/projectile-refresh-known-paths)
  (:prefix ("t")
   :n "k" #'clm/toggle-command-log-buffer)))

(map!
 ;; Keep in alphabetical order.
 :map global-map
 "M-N" #'operate-on-number-at-point
 :v "C-r" #'cashweaver/replace-selection
 (:prefix ("z")
  :n "O" #'evil-open-fold-rec))
#+end_src

** Emacs


#+begin_src emacs-lisp :tangle config-personal.el
(setq
 ;; Avoid frequent garbage collection by setting a high threshold.
 gc-cons-threshold (math-pow 10 8))
#+end_src

* Doom Emacs
I use [[github:hlissner/doom-emacs][Doom Emacs]] as the base for my configuration to save time and get to coding faster than I would if I had to roll an entire configuration from scratch.

** Configuration File headers

The base configuration files (=init.el=, =config.el=, and =packages.el=) include a bit of boilerplate when you first create them using =doom install=. I like to preserve this boilerplate.

#+HTMl: <details><summary>init.el</summary>
#+attr_html: :collapsed t
#+begin_src emacs-lisp :tangle init.el
;;; init.el -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE MANUALLY.
;; This file is generated from doom.md. You should make your changes there and
;; this file using org-babel-tangle.

;; This file controls what Doom modules are enabled and what order they load
;; in. Remember to run 'doom sync' after modifying it!

;; NOTE Press 'SPC h d h' (or 'C-h d h' for non-vim users) to access Doom's
;;      documentation. There you'll find a "Module Index" link where you'll find
;;      a comprehensive list of Doom's modules and what flags they support.

;; NOTE Move your cursor over a module's name (or its flags) and press 'K' (or
;;      'C-c c k' for non-vim users) to view its documentation. This works on
;;      flags as well (those symbols that start with a plus).
;;
;;      Alternatively, press 'gd' (or 'C-c c d') on a module to browse its
;;      directory (for easy access to its source code).
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>packages-personal.el</summary>
#+attr_html: :collapsed t
#+begin_src emacs-lisp :tangle packages-personal.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages-personal.el

;; DO NOT EDIT THIS FILE MANUALLY.
;; This file is generated from doom.md. You should make your changes there and
;; this file using org-babel-tangle.

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;(package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/raxod502/straight.el#the-recipe-format
;(package! another-package
;  :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;(package! this-package
;  :recipe (:host github :repo "username/repo"
;           :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;(package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;(package! builtin-package :recipe (:nonrecursive t))
;(package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see raxod502/straight.el#279)
;(package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;(package! builtin-package :pin "1a2b3c4d5e")


;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;(unpin! pinned-package)
;; ...or multiple packages
;(unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;(unpin! t)
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>config-personal.el</summary>
#+attr_html: :collapsed t
#+begin_src emacs-lisp :tangle config-personal.el
;;; $DOOMDIR/config-personal.el -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE MANUALLY.
;; This file is generated from doom.md. You should make your changes there and
;; this file using org-babel-tangle.

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
; (setq user-full-name "John Doe"
;       user-mail-address "john@doe.com")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
; (setq doom-theme 'doom-one)

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
; (setq org-directory "~/org/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
; (setq display-line-numbers-type t)


;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
#+end_src
#+HTMl: </details>

