config/doom/config-personal.org
*** Compose in =org-mode=

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/compose-mail-org ()
  (interactive)
  (compose-mail)
  (message-goto-body)
  (setq *compose-html-org* t)
  (org-mode))

;; Deprecated in favor of org-mime `org-mime-edit-mail-in-org-mode'
(defun cashweaver/mail-toggle-org-message-mode ()
  (interactive)
  (if (derived-mode-p 'message-mode)
      (progn
        (setq *compose-html-org* t)
        (org-mode)
        (message "enabled org-mode"))
    (progn
      (setq *compose-html-org* nil)
      (notmuch-message-mode)
      (message "enabled notmuch-message-mode"))))

(defun cashweaver/mail-get-short-address (address)
  "Returns \"foo@\" for an ADDRESS of \"Foo <foo@bar.com>\"."
  (cond
   ((not (string-match "<" address))
    address)
   (t
    (replace-regexp-in-string
     ".*<\\(.*\\)@.*>"
     "\\1@"
     address))))

(defun cashweaver/mail-create-follow-up-todo ()
  (interactive)
  (let* ((file
          cashweaver/path--file--notes-todos)
         (to-short
          (cashweaver/mail-get-short-address
           (message-field-value "To")))
         (from-short
          (cashweaver/mail-get-short-address
           (message-field-value "From")))
         (subject
          (message-field-value "Subject"))
         (message-id
          (replace-regexp-in-string
           "<\\(.*\\)>"
           "\\1"
           (message-field-value "Message-ID")))
         (now
          (with-temp-buffer
            (org-mode)
            (org-time-stamp-inactive '(16))
            (buffer-substring-no-properties
             (point-min)
             (point-max)))))
    (with-current-buffer
        (get-file-buffer file)
      (goto-char
       (point-max))
      (org-insert-heading-respect-content)
      (org-todo "TODO")
      (insert
       (s-lex-format
        "[[notmuch:id:${message-id}][${subject} (${from-short} ➤ ${to-short})]]: Follow up :email:"
        ))
      (org-set-property
       "Created"
       now)
      (org-schedule
       nil))))

(defun cashweaver/message-send-and-exit ()
  (interactive)
  (org-mime-htmlize)
  (notmuch-mua-send)
  (if (y-or-n-p "Create follow-up TODO?")
      (cashweaver/mail-create-follow-up-todo))
  (kill-buffer
   (current-buffer)))
#+end_src

*** Custom =send-mail-function=

I need to use a different =send-mail-function= when sending email at work. I override =cashweaver/send-mail-function=, etc, in =config-work.el=.

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/send-mail-function (&rest args)
  "Wrapper method for `send-mail-function' for easy overriding in work environment."
  (apply #'sendmail-query-once args))

(defun cashweaver/message-send-mail-function (&rest args)
  "Wrapper method for `message-send-mail-function' for easy overriding in work environment."
  (apply #'message--default-send-mail-function args))

(setq
 send-mail-function #'cashweaver/send-mail-function
 message-send-mail-function #'cashweaver/message-send-mail-function)
#+end_src
*** Keybindings

#+begin_src emacs-lisp :tangle config-personal.el
(after! notmuch
  ;; Keep in alphabetical order.
  (map!
   :map notmuch-message-mode-map
   "C-c C-c" #'cashweaver/message-send-and-exit)

  (map!
   :map notmuch-message-mode-map
   :localleader
   "e" #'org-mime-edit-mail-in-org-mode)

  (map!
   :map notmuch-show-mode-map
   "M-RET" #'cashweaver/notmuch-show-open-or-close-all)

  ;; Reply-all should be the default.
  (evil-define-key 'normal notmuch-show-mode-map "cr" 'notmuch-show-reply)
  (evil-define-key 'normal notmuch-show-mode-map "cR" 'notmuch-show-reply-sender)

  ;; Easy archive for my most-used tags.
  (evil-define-key 'normal notmuch-search-mode-map "A" 'notmuch-search-archive-thread)
  (evil-define-key 'normal notmuch-search-mode-map "a" 'cashweaver/notmuch-search-super-archive)
  (evil-define-key 'visual notmuch-search-mode-map "a" 'cashweaver/notmuch-search-super-archive)
  (evil-define-key 'normal notmuch-search-mode-map "f" 'cashweaver/notmuch-search-follow-up)

  ;; Unbind "t", and re-bind it to "T", so we can set it up as a prefix.
  (evil-define-key 'normal notmuch-search-mode-map "t" nil)
  (evil-define-key 'normal notmuch-search-mode-map "T" 'notmuch-search-filter-by-tag)

  ;; Helpers for toggling often-used tags.
  (evil-lambda-key 'normal notmuch-search-mode-map "t0" '(lambda ()
                                                           "Toggle p0"
                                                           (interactive)
                                                           (cashweaver/notmuch-search-toggle-tag "p0")))
  (evil-lambda-key 'normal notmuch-search-mode-map "tr" '(lambda ()
                                                           "Toggle Read!"
                                                           (interactive)
                                                           (cashweaver/notmuch-search-toggle-tag "Read!")))
  (evil-lambda-key 'normal notmuch-search-mode-map "tw" '(lambda ()
                                                           "Toggle waiting"
                                                           (interactive)
                                                           (cashweaver/notmuch-search-toggle-tag "waiting"))))


#+end_src

** Calendar
*** Packages
**** =calfw=

Disabled, for the moment. I've preserved my configuration for future reference.

***** Package
Provided through =app/calendar= in =init.el=.

***** Config
#+begin_src emacs-lisp :tangle config-personal.el
;(use-package! calfw-cal
;  :config
;  (setq
;   ; Start the week on Monday
;   calendar-week-start-day 1))
;
;(use-package! calfw-ical)
;(use-package! calfw-org)
;
;(defun cashweaver/calfw-open ()
;  "Open my calendar"
;  (interactive)
;  (cfw:open-calendar-buffer
;   :contents-sources
;   (list
;    (cfw:org-create-source "Green"))))
#+end_src

* Languages
** General
*** Completion

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 completion-ignore-case t)
#+end_src

*** Packages
**** =aggressive-indent=
***** Package

#+begin_src emacs-lisp :tangle packages-personal.el
(package! aggressive-indent)
#+end_src

**** =langtool=

See https://languagetool.org/

Install =LanguageTool=:

1. Download the [[https://languagetool.org/download/LanguageTool-stable.zip][latest stable build]].
2. Store it somewhere on your system.
3. Configure (see below).

***** Package

Doom emacs provides =langtool= through =init.el=.

***** Config

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! langtool
  :init
  (setq
   langtool-language-tool-server-jar
   "~/third_party/LanguageTool-5.5/languagetool-server.jar"
   ;;langtool-language-tool-jar
   ;;"~/third_party/LanguageTool-5.5/languagetool-commandline.jar"
   )
  :config
  (setq
   langtool-default-language
   "en-US"
   langtool-mother-tongue
   "en"))
#+end_src

**** =operate-on-number=

#+begin_quote
Suppose the point is on some number.  If you want to double it,
invoke `operate-on-number-at-point' followed by some keys: * 2 RET.

/[[github:knu/operate-on-number.el/blob/master/operate-on-number.el][operate-on-number.el]]/
#+end_quote

***** Package

#+begin_src emacs-lisp :tangle packages-personal.el
(package! operate-on-number
  :recipe (:host github
           :repo "knu/operate-on-number.el"))
#+end_src

***** Config

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! operate-on-number)
#+end_src

**** =writeroom-mode=

***** Package

=init.el= provides =writeroom-mode=.

***** Config

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! writeroom-mode
  :config
  (setq
   +zen-mixed-pitch-modes '()
   writeroom-width 30))
#+end_src
** Emacs Lisp (elisp)

Use =aggressive-indent= when editing =elisp=.

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! aggressive-indent
  :config
  (add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode))
#+end_src

*** Packages
** Java
** TODO Org
*** Packages
**** =anki-editor=
#+begin_quote
anki-editor – An Emacs minor mode for making Anki cards with Org

/[[github:louietan/anki-editor][louietan/anki-editor]]/
#+end_quote

Use my fork of =louitan/anki-editor= to include pull-requests which aren't yet merged.

#+begin_src emacs-lisp :tangle packages-personal.el
(package! anki-editor
  :recipe (:host github
           :repo "cashweaver/anki-editor"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! anki-editor)
#+end_src

**** =doct= ([[github:progfolio/doct][Declarative Org Capture Template]])

#+begin_quote
=doct= is a function that provides an alternative, declarative syntax for describing Org capture templates.

/[[github:progfolio/doct][progfolio/doct]]/
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! doct)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! doct
  :commands (doct))
#+end_src
**** =org-ql=
#+begin_quote
/[[github:alphapapa/org-ql][alphapapa/org-ql]]/

This package provides a query language for Org files. It offers two syntax styles: Lisp-like sexps and search engine-like keywords.
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-ql)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-ql)
#+end_src

**** =org-gcal=
#+begin_quote
org-gcal offers

- Fetch google calendar event
- Post/edit org element
- Sync between Org and Gcal

/[[github:kidd/org-gcal.el][kidd/org-gcal.el]]/
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-gcal
  :recipe (:host github
           :repo "kidd/org-gcal.el"))
#+end_src

**** =org-mime=

#+begin_quote
This program sends HTML email using Org-mode HTML export.

This approximates a WYSiWYG HTML mail editor from within Emacs, and can be useful for sending tables, fontified source code, and inline images in email.

/[[github:org-mime/org-mime][org-mime/org-mime]]/
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-mime)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-mime)
#+end_src

***** TODO Debug "Too early load" error

**** =org-noter=
#+begin_quote
Org-noter’s purpose is to let you create notes that are kept in sync when you scroll through the document, but that are external to it - the notes themselves live in an Org-mode file. As such, this leverages the power of Org-mode (the notes may have outlines, latex fragments, babel, etc…) while acting like notes that are made inside the document. Also, taking notes is very simple: just press i and annotate away!

/[[github:weirdNox/org-noter][weirdNox/org-noter]]/
#+end_quote

I've customized org-noter to [[github:cashweaver/org-noter/commit/e18a4314308d5dd211759682b1aeb083a822673d][wrap quoted text with =begin_quote=/=end_quote=]]

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-noter
  :recipe (:host github
           :repo "cashweaver/org-noter"))
#+end_src

**** =org-notmuch=

#+begin_quote
[...] implements links to notmuch messages and "searches".  A search is a query to be performed by notmuch; it is the equivalent ;; to folders in other mail clients.  Similarly, mails are referred to ;; by a query, so both a link can refer to several mails.

/ol-notmuch.el/
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! ol-notmuch)
#+end_src
**** =org-super-agenda=

#+begin_quote
This package lets you "supercharge" your Org daily/weekly agenda. The idea is to group items into sections, rather than having them all in one big list.

/[[github:alphapapa/org-super-agenda][alphapapa/org-super-agenda]]/
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-super-agenda)
#+end_src
**** =org-roam=
#+begin_quote
Org-roam is a plain-text knowledge management system. It brings some of Roam's more powerful features into the Org-mode ecosystem.

Org-roam borrows principles from the Zettelkasten method, providing a solution for non-hierarchical note-taking. It should also work as a plug-and-play solution for anyone already using Org-mode for their personal wiki.

/[[github:org-roam/org-roam][org-roam/org-roam]]/
#+end_quote

Doom Emacs provides =org-roam=.

#+begin_src emacs-lisp :tangle packages-personal.el
(unpin! org-roam)
#+end_src

**** =ox-pandoc=
#+begin_quote
ox-pandoc is an exporter for Org mode which converts Org-mode files to a wide variety of other formats using the pandoc tool. Pandoc can produce PDFs, HTML, presentations, markdown files, office documents and e-pub publications as well as a number of other more specialised formats.

/[[github:emacsorphanage/ox-pandoc][emacsorphanage/ox-pandoc]]/
#+end_quote


#+begin_src emacs-lisp :tangle packages-personal.el
(package! ox-pandoc)
#+end_src

**** =ox-hugo=
#+begin_quote
ox-hugo is an Org exporter backend that exports Org to Hugo-compatible Markdown (Blackfriday) and also generates the front-matter (in TOML or YAML format).

/[[github:kaushalmodi/ox-hugo]]/
#+end_quote

My corporate profile loads [[github:cashweaver/ox-hugo-corp][cashweaver/ox-hugo-corp]] -- a corporate-safe version of ox-hugo.

#+begin_src emacs-lisp :tangle packages-personal.el
(when (not (cashweaver/is-work-cloudtop-p))
  (package! ox-hugo))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(when (not (cashweaver/is-work-cloudtop-p))
  (use-package! ox-hugo
    :after ox))
#+end_src

**** =org-download=
#+begin_quote
This extension facilitates moving images from point A to point B.

Point A (the source) can be:

1. An image inside your browser that you can drag to Emacs.
1. An image on your file system that you can drag to Emacs.
1. A local or remote image address in kill-ring. Use the org-download-yank command for this. Remember that you can use "0 w" in dired to get an address.
1. A screenshot taken using gnome-screenshot, scrot, gm, xclip (on Linux), screencapture (on OS X) or , imagemagick/convert (on Windows). Use the org-download-screenshot command for this. Customize the backend with org-download-screenshot-method.

Point B (the target) is an Emacs org-mode buffer where the inline link will be inserted. Several customization options will determine where exactly on the file system the file will be stored.

/[[github:abo-abo/org-download]]/
#+end_quote


#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-download)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
;; Too early load error
;; (use-package! org-download)
#+end_src
***** TODO Debug "Too early load" error
**** =orgaggregate=

#+begin_quote
Aggregating a table is creating a new table by computing sums, averages, and so on, out of material from the first table.

/[[github:abo-abo/org-download]]/
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! orgtbl-aggregate)
#+end_src

**** =org-transclusion=
#+begin_quote
Org-transclusion lets you insert a copy of text content via a file link or ID link within an Org file. It lets you have the same content present in different buffers at the same time without copy-and-pasting it. Edit the source of the content, and you can refresh the transcluded copies to the up-to-date state. Org-transclusion keeps your files clear of the transcluded copies, leaving only the links to the original content.

[[github:nobiot/org-transclusion]]
#+end_quote


#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-transclusion)
#+end_src

