config/doom/packages-personal.el
           :repo "knu/operate-on-number.el"))

(package! anki-editor
  :recipe (:host github
           :repo "cashweaver/anki-editor"))

(package! doct)

(package! org-ql)

(package! org-gcal
  :recipe (:host github
           :repo "kidd/org-gcal.el"))

(package! org-mime)

(package! org-noter
  :recipe (:host github
           :repo "cashweaver/org-noter"))

(package! ol-notmuch)

(package! org-super-agenda)

(unpin! org-roam)

(package! ox-pandoc)

(package! org-download)

(package! orgtbl-aggregate)

(package! org-transclusion)

(package! ol-doi
