config/doom/config-personal.org
**** =citar=

Doom emacs installs =citar=.

**** Org Citations (=oc=)

Emacs provides =oc= .

**** =ol-doi=

Digital Object Identifier link support.

#+begin_example
[[doi:foo][bar]]
#+end_example

#+begin_src emacs-lisp :tangle packages-personal.el
(package! ol-doi
  :recipe (:repo "https://git.savannah.gnu.org/git/emacs/org-mode.git"
           :branch "main"
           :files ("lisp/ol-doi.el")))
#+end_src

**** =org-protocol=

#+begin_quote
org-protocol intercepts calls from emacsclient to trigger custom actions without external dependencies.

https://orgmode.org/worg/org-contrib/org-protocol.html
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
;;(package! org-protocol)
#+end_src

**** =org-protocol-capture-html=

#+begin_quote
org-protocol is awesome, but browsers do a pretty poor job of turning a page’s HTML content into plain-text. However, Pandoc supports converting from HTML to org-mode, so we can use it to turn HTML into Org-mode content! It can even turn HTML tables into Org tables!

https://github.com/alphapapa/org-protocol-capture-html
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-protocol-capture-html
  :recipe (:host github
           :repo "alphapapa/org-protocol-capture-html"))
#+end_src

**** =org-roam-ui=

#+begin_quote
Org-Roam-UI is a frontend for exploring and interacting with your [[https://github.com/org-roam/org-roam][org-roam]] notes.

https://github.com/org-roam/org-roam-ui
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-roam-ui)
#+end_src

**** =cashweaver/contacts=

#+begin_src emacs-lisp :tangle config-personal.el
(cl-defun cashweaver/contacts--has-prop? (prop)
  "Returns nil if the contact lacks the PROP."
  (member
   prop
   (org-buffer-property-keys)))

(cl-defun cashweaver/contacts--get-prop (prop)
  "Returns value of PROP or nil if PROP not found."
  (org-entry-get
   (point)
   prop))

(cl-defun cashweaver/contacts--list-top-level-headings ()
  "TODO"
  (org-map-entries
   (lambda ()
     (message (org-entry-get nil "ITEM")))
   "LEVEL=1"))

(cl-defun cashweaver/contacts--heading-exists? (heading-text)
  "Return t if HEADING-TEXT is among top-level headings and nil otherwise."
  (and (org-find-exact-headline-in-buffer
        heading-text)
       t))

(cl-defun cashweaver/contacts--top-level-heading-exists? (heading-text)
  "Return t if HEADING-TEXT is among top-level headings and nil otherwise."
  (member heading-text
          (cashweaver/contacts--list-top-level-headings)))

(cl-defun cashweaver/contacts--list-child-headings ()
  "TODO"
  (interactive)
  (org-map-entries
   (lambda ()
     (org-entry-get nil "ITEM"))
   nil 'tree))

(cl-defun cashweaver/contacts--create-top-level-heading-if-absent (heading-text &optional pos)
  "Creates a top-level heading with HEADING-TEXT at POS if such a heading doesn't exist in buffer.

Returns nil if the heading already existed."
  (let ((pos
         (or pos
             (point-max))))
    (if (member heading-text
                (cashweaver/contacts--list-top-level-headings))
        (return-from
            cashweaver/contacts--create-top-level-heading-if-absent
          nil))

    (goto-char
     pos)
    (org-insert-heading
     ;; arg
     nil
     ;; invisible-ok
     t
     ;; top
     t)
    (insert heading-text)))

(cl-defun cashweaver/contacts--goto-heading (heading-text)
  "Move pointer to the heading with HEADING-TEXT.

Does nothing if such a heading is absent."
  (let ((heading-position
         (org-find-exact-headline-in-buffer
          heading-text)))
    (unless heading-position
      (return-from
          cashwever/contacts--goto-heading
        nil))

    (goto-char
     heading-position)))

(cl-defun cashweaver/contacts-create-reminder (reminder date)
  "Creates a reminder."
  (interactive)
  (cashweaver/contacts--create-top-level-heading-if-absent
   ;; TODO: Convert this to a defcustom.
   "Reminders")
  (cashweaver/contacts--goto-heading
   ;; TODO: Convert this to a defcustom.
   "Reminders")
  (org-insert-subheading
   ;; arg
   nil)
  (insert
   reminder)
  (message date)
  (org-schedule
   ;; arg
   nil
   ;; time
   date)
  (org-set-property
   ;; TODO: Convert this to a defcustom.
   "CREATED_AT"
   (cashweaver/format-time
    "[%Y-%m-%d %a %H:%M:%S]")))

(cl-defun cashweaver/contacts-file? (&optional file)
  "Contacts files are roam files."
  (org-roam-file-p))

(cl-defun cashweaver/contacts--create-birthday-reminder ()
  "Creates an annual birthday reminder."
  (message "foo")
  (unless (cashweaver/contacts-file?)
    (return-from
        cashweaver/contacts--create-birthday-reminder
      nil))

  (unless (cashweaver/contacts--has-prop?
           ;; TODO: Convert this to a defcustom.
           "BIRTHDAY")
    (message "Birthday not set. Cannot create reminder.")
    (return-from
        cashweaver/contacts--create-birthday-reminder
      nil))

  (let ((reminder-text
         (s-format
          "${name}'s Birthday"
          'aget
          `(("name" . ,(cashweaver/contacts--get-name))))))
    (when (cashweaver/contacts--heading-exists?
           reminder-text)
      (message "Birthday reminder exists. Skipping.")
      (return-from
          cashweaver/contacts--create-birthday-reminder
        nil))

    (let* ((birth-date
            (org-read-date
             ;; with-time
             nil
             ;; to-time
             t
             ;; from-string
             (cashweaver/contacts--get-prop
              ;; TODO: Convert this to a defcustom.
              "BIRTHDAY")
             ;; prompt
             nil))
           (birth-month
            (format-time-string
             "%m"
             birth-date))
           (birth-day
            (format-time-string
             "%d"
             birth-date))
           (current-year
            (format-time-string
             "%Y"
             (current-time)))
           (next-year
            (format-time-string
             "%Y"
             (time-add
              (current-time)
              (days-to-time 365))))
           (birthday-has-passed-this-year
            (string<
             (format "%s%s%s" current-year birth-month birth-day)
             (cashweaver/format-time
              "%Y%m%d")))
           (reminder-year
            (if birthday-has-passed-this-year
                next-year
              current-year))
           (reminder-scheduled-date
            (s-format
             "<${year}-${month}-${day} +1y>"
             'aget
             `(("year" . ,reminder-year)
               ("month" . ,birth-month)
               ("day" . ,birth-day)))
            ))
      (cashweaver/contacts-create-reminder
       reminder-text
       reminder-scheduled-date))))

(cl-defun cashweaver/contacts--get-name (&optional path)
  (let ((path
         (or
          path
          (buffer-file-name
           (buffer-base-buffer)))))
    (unless path
      (return-from
          cashweaver/contacts--get-name
        nil))

    (with-current-buffer
        (get-file-buffer path)
      (pcase
          (org-collect-keywords '("TITLE"))
        (`(("TITLE" . ,val))
         (car val))))))

(defcustom cashweaver/contacts-field-birthday
  "BIRTHDAY"
  "Birthday field used in contact properties.")

(defun cashweaver/contacts-aniversaries (contact-file-directory &optional field)
  "Compute FIELD anniversaries for each contact.

Based on `org-contacts-anniversaries'."
  (let ((field
         (or field
             cashweaver/contacts-field-birthday))
        (contact-files
         (org-roam--list-files
          (expand-file-name
           contact-file-directory))))
    ;; (loop for file in contact-files
    ;;       for anniversary = (let ((anniversary
    ;;                                ))))
    ))

(defun cashweaver/contacts--get-contacts ()
  (let ((org-roam-directory
         "~/proj/people")
        (org-roam-db-location
         "~/proj/people/org-roam.db"))
    (when (emacsql-live-p
           (org-roam-db--get-connection))
      (emacsql-close
       (org-roam-db--get-connection)))
    (org-roam-db)
    (org-roam-db-query
     [:select *
      :from nodes])))


;; (cashweaver/contacts--create-birthday-reminder)
;; (cashweaver/contacts--create-top-level-heading-if-absent "foo")
;; (cashweaver/contacts--get-name)
;; (cashweaver/contacts--list-top-level-headings)
#+end_src

***** TODO Move this to separate package file.

**** =org-gtasks=

#+begin_quote
Export/import all Google Tasks to org files.

https://github.com/JulienMasson/org-gtasks
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-gtasks
  :recipe (:host github
           :repo "JulienMasson/org-gtasks"))
#+end_src

**** =org-vcard=

#+begin_quote
=org-vcard= is a package for exporting and importing [[https://en.wikipedia.org/wiki/Vcard][vCards]] from within [[https://www.gnu.org/software/emacs/][GNU Emacs]]' [[http://orgmode.org/][Org mode]].

https://github.com/flexibeast/org-vcard#table-of-contents
#+end_quote

#+begin_src emacs-lisp :tangle packages-personal.el
(package! org-vcard)
#+end_src
*** Helper Methods
**** Insert a heading for today

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org-mode--heading-text-for-today (&optinoal time-in-heading include-all-tags)
  "Return the heading text for today as a string."
  (let* ((time-in-heading
          (or time-in-heading
              nil))
         (include-all-tags
          (or include-all-tags
              nil))
         (today-week-number
          (cashweaver/format-time
           "%W"))
         (today-quarter-number
          (cashweaver/format-time
           "%q"))
         (today-year
          (cashweaver/format-time
           "%Y"))
         (today-month-number
          (cashweaver/format-time
           "%m"))
         (today-day-number
          (cashweaver/format-time
           "%d"))
         (today-weekday-abbreviated-name
          (cashweaver/format-time
           "%a"))
         (tags
          (if include-all-tags
              (s-format
               ":${year}:${year}week${week-number}:${year}Q${quarter-number}:"
               'aget
               `(("year" . ,today-year)
                 ("week-number" . ,today-week-number)
                 ("quarter-number" . ,today-quarter-number)))
            "")))
    (s-format
     "[${yyyy-mm-dd} ${short-weekday}${hour-minute}] ${tags}"
     'aget
     `(("yyyy-mm-dd" . ,(format "%s-%s-%s"
                                today-year
                                today-month-number
                                today-day-number))
       ("short-weekday" . ,today-weekday-abbreviated-name)
       ("year" . ,today-year)
       ("week-number" . ,today-week-number)
       ("quarter-number" . ,today-quarter-number)
       ("hour-minute" . ,(if time-in-heading
                             (format " %s"
                                     (cashweaver/format-time "%H:%M"))
                           ""))
       ("tags" . ,tags)))))

(defun cashweaver/org-mode-insert-heading-for-today (&optional top time-in-heading include-all-tags)
  "Insert a heading for today's date, with relevant tags."
  (interactive)
  (let ((heading-text
         (cashweaver/org-mode--heading-text-for-today
          ;; top
          nil
          time-in-heading
          include-all-tags))
        (today-yyyy-mm-dd (cashweaver/format-time "%Y-%m-%d"))
        (today-hh-mm (cashweaver/format-time "%H:%M"))
        (today-weekday-abbreviated-name (cashweaver/format-time "%a")))
    (if top
        (org-insert-heading nil t t)
      (org-insert-heading-respect-content))
    (insert
     heading-text)
    (org-set-property
     "Created"
     (format "[%s %s %s]"
             today-yyyy-mm-dd
             today-weekday-abbreviated-name
             today-hh-mm))))

(defun cashweaver/org-mode-heading-marker-for-today ()
  "Return t if a heading for today exists.

Refer to `cashweaver/org-mode-insert-heading-for-today'."
  (let ((headline-text
         (cashweaver/org-mode--heading-text-for-today))
        (headline-marker
         (org-find-exact-headline-in-buffer
          headline-text)))
    headline-marker))
#+end_src

**** Insert a heading for this week

#+begin_src emacs-lisp
(defun cashweaver/org-mode-insert-heading-for-this-week (&optional include-all-tags)
  "Insert a heading for this week, with relevant tags."
  (interactive)
  (let* ((include-all-tags
          (or include-all-tags
              nil))
         (today-week-number
          (cashweaver/format-time "%W"))
         (today-quarter-number
          (cashweaver/format-time "%q"))
         (today-year
          (cashweaver/format-time "%Y"))
         (tags
          (if include-all-tags
              (s-format
               ":${year}week${week-number}:${year}Q${quarter-number}:"
               'aget
               `(("week-number" . ,today-week-number)
                 ("quarter-number" . ,today-quarter-number)))
            (s-format
             ":${year}week${week-number}:"
             'aget
             `(("year" . ,today-year)
               ("week-number" . ,today-week-number))))))
    (org-insert-heading-respect-content)
    (insert
     (s-format
      "${year} Week ${week-number} ${tags}"
      'aget
      `(("year" . ,today-year)
        ("week-number" . ,today-week-number)
        ("tags" . ,tags))))))
#+end_src

**** Insert a log heading for today

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org-mode-insert-heading-for-today-log ()
  "Insert a heading for today's date formatted for the log file."
  (interactive)
  (let* ((today-year
          (cashweaver/format-time
           "%Y"))
         (today-month-number
          (cashweaver/format-time
           "%m"))
         (today-day-number
          (cashweaver/format-time
           "%d"))
         (today-YYYY-MM-DD
          (s-lex-format
           "${today-year}-${today-month-number}-${today-day-number}")
          ))
    (cashweaver/org-mode-insert-heading-for-today)
    (org-insert-subheading
     nil)
    (insert
     (s-lex-format
      "[${today-YYYY-MM-DD} 08:00-09:00]"))
    (cl-loop for (start . end) in '(("09:00" . "10:00")
                                    ("10:00" . "11:00")
                                    ("11:00" . "12:00")
                                    ("14:00" . "15:00")
                                    ("15:00" . "16:00")
                                    ("16:00" . "17:00"))
             do
             (org-insert-heading
              nil)
             (insert
              (s-lex-format
               "[${today-YYYY-MM-DD} ${start}-${end}]")))))
#+end_src

