config/doom/packages-personal.el
  :recipe (:repo "https://git.savannah.gnu.org/git/emacs/org-mode.git"
           :branch "main"
           :files ("lisp/ol-doi.el")))

;;(package! org-protocol)

(package! org-protocol-capture-html
  :recipe (:host github
           :repo "alphapapa/org-protocol-capture-html"))

(package! org-roam-ui)

(package! org-gtasks
  :recipe (:host github
           :repo "JulienMasson/org-gtasks"))

(package! org-vcard)
