config/doom/config-personal.org
**** Scheduling task for my calendar blocks

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 cashweaver/-schedule-block-day '(:start "07:00" :end "19:00")
 cashweaver/-schedule-block-one '(:start "07:00" :end "09:00")
 cashweaver/-schedule-block-two '(:start "09:00" :end "11:00")
 cashweaver/-schedule-block-three '(:start "14:00" :end "16:00")
 cashweaver/-schedule-block-four '(:start "16:00" :end "18:00"))

(defun cashweaver/org-schedule-for-block (block-time &optional date)
  (interactive)
  (let ((start-time (plist-get block-time :start))
        (end-time (plist-get block-time :end))
        (date (or date "today")))
    (org-schedule nil (format "%s %s-%s"
                              date
                              start-time
                              end-time))))

(defun cashweaver/org-schedule-today-from-to (start-time end-time &optional date)
  (interactive)
  (let ((date (or date "today")))
    (org-schedule nil (format "%s %s-%s"
                              date
                              start-time
                              end-time))))
#+end_src

**** Scheduling tanglesk for my calendar blocks

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 cashweaver/-schedule-block-day '(:start "07:00" :end "19:00")
 cashweaver/-schedule-block-one '(:start "07:00" :end "09:00")
 cashweaver/-schedule-block-two '(:start "09:00" :end "11:00")
 cashweaver/-schedule-block-three '(:start "14:00" :end "16:00")
 cashweaver/-schedule-block-four '(:start "16:00" :end "18:00"))

(defun cashweaver/org-schedule-for-block (block-time &optional date)
  (interactive)
  (let ((start-time (plist-get block-time :start))
        (end-time (plist-get block-time :end))
        (date (or date "today")))
    (org-schedule nil (format "%s %s-%s"
                              date
                              start-time
                              end-time))))

(defun cashweaver/org-schedule-today-from-to (start-time end-time &optional date)
  (interactive)
  (let ((date (or date "today")))
    (org-schedule nil (format "%s %s-%s"
                              date
                              start-time
                              end-time))))
#+end_src

**** Schedule task

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org--schedule-today-at (start-time-as-string)
  "Schedule a task today at the specified time."
  (interactive "sWhen?: ")
  (message start-time-as-string)
  (string-match
   "^\\([1-9]\\|[01][0-9]\\|2[0-3]\\):?\\([0-5][0-9]\\)?$"
   start-time-as-string)
  (let
      ((hour
        (string-to-number
         (or
          (match-string 1 start-time-as-string)
          "0")))
       (minute
        (string-to-number
         (or
          (match-string 2 start-time-as-string)
          "0"))))
    (org-schedule nil (format "today %02d:%02d"
                              hour
                              minute))
    (message (number-to-string hour))
    ))
#+end_src

**** Schedule task for duration

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org--schedule-for (start-time end-time &optional date)
  (let ((date (or date "today")))
    (org-schedule nil (format "%s %s-%s"
                              date
                              start-time
                              end-time))))
    ;(org-schedule nil (format "%s %s-%s"
                              ;date
                              ;start-time
                              ;end-time))))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org--schedule-at-for-minutes (start-minute start-hour duration-in-minutes &optional date)
  (let* ((start-time-in-minutes-since-midnight
         (+ start-minute (* start-hour 60)))
        (end-time-in-minutes-since-midnight
         (+ start-time-in-minutes-since-midnight duration-in-minutes))
        (end-minute (mod end-time-in-minutes-since-midnight 60))
        (end-hour (/ end-time-in-minutes-since-midnight 60))
        (date (or date "today")))
    (org-schedule nil (format "%s %02d:%02d-%02d:%02d"
                              date
                              start-hour
                              start-minute
                              end-hour
                              end-minute))))
#+end_src

**** Scheduling task at start of pomodoro

#+begin_src emacs-lisp :tangle config-personal.el
(setq
 cashweaver/-schedule-pomodoro-one '(:start "09:00" :end "09:50")
 cashweaver/-schedule-pomodoro-two '(:start "10:00" :end "10:50")
 cashweaver/-schedule-pomodoro-three '(:start "11:00" :end "11:50")
 cashweaver/-schedule-pomodoro-four '(:start "12:00" :end "12:50")
 cashweaver/-schedule-pomodoro-five '(:start "13:00" :end "13:50")
 cashweaver/-schedule-pomodoro-six '(:start "14:00" :end "14:50")
 cashweaver/-schedule-pomodoro-seven '(:start "15:00" :end "15:50")
 cashweaver/-schedule-pomodoro-eight '(:start "16:00" :end "16:50")
 cashweaver/-schedule-pomodoro-nine '(:start "17:00" :end "17:50")
 cashweaver/-schedule-pomodoro-ten '(:start "18:00" :end "18:50"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org-schedule-at-pomodoro (pomodoro-time &optional date)
  (interactive)
  (let ((start-time (plist-get pomodoro-time :start)))
        (date (or date "today")))
    (org-schedule nil (format "%s %s"
                              date
                              start-time)))
#+end_src

**** Scheduling task in N hours

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org-schedule-in-n-hours (offset-hours &optional date)
  (interactive)
  (let* ((time-list (parse-time-string (current-time-string)))
         (current-hour (nth 2 time-list))
         (current-minute (nth 1 time-list))
         (hour (mod (+ current-hour offset-hours) 24))
         (date (or date "today")))
    (org-schedule nil (format "%s %s:%s"
                              date
                              hour
                              current-minute))))
#+end_src

**** Scheduling task in N days

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org-schedule-in-n-workdays (num-days &optional time)
  (interactive)
  (let*
      ((time (or time "09:00"))
       (offset-days))
    (org-schedule
     nil
     (format "%s %s"
             offset-days
             time))))
#+end_src

**** Goto most recent timestamp in buffer

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org-get-timestamps-in-time-order ()
  "Return a list of timestamps from the current buffer in time order."
  (cl-sort
   (org-element-map
       (org-element-parse-buffer)
       'timestamp
     (lambda (timestamp)
       `(,(org-element-property :raw-value timestamp) . ,(org-element-property :begin timestamp))))
   'org-time>
   :key 'car))

(defun cashweaver/org-goto-most-recent-timestamp ()
  "`goto-char' the most recent timestamp in the current buffer."
  (interactive)
  (let ((timestamps
         (cashweaver/org-get-timestamps-in-time-order)))
    (goto-char
     (cdr
      (pop timestamps)))))

(defun cashweaver/org-goto-most-recent-timestamp-with-property (property)
  "`goto-char' the most recent timestamp in the current buffer with a non-nil value for the provided property."
  (interactive)
  (let ((timestamps
         (cashweaver/org-get-timestamps-in-time-order)))
    (goto-char
     (cdr
      (pop timestamps)))
    (while (and timestamps
                (not
                 (org-entry-get
                  (point)
                  property)))
      (goto-char
       (cdr
        (pop timestamps))))))
#+end_src

**** Edit FILETAGS

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org-mode-set-filetag (value)
   "Add another option; requires at least one option to already be present."
  (message "---")
  (goto-char
   (point-min))
  (if (search-forward-regexp
       "#\\+\\(FILETAGS\\|filetags\\): "
       ;; bound
       nil
       ;; noerror
       t)
      (progn
        (end-of-line)
        (insert (format "%s:" value)))
    (progn
      ;; Add filetags beneath the title; assumes there is a title
      (goto-char
       (point-min))
      (when (search-forward-regexp
          "^#\\+\\(TITLE\\|title\\):")
        (end-of-line)
        (newline)
        (cashweaver/org-mode-insert-option
         "FILETAGS"
         (format ":%s:"
                 value))))))

(defun cashweaver/org-mode-insert-option (option value)
  "Insert an org-mode option (#+OPTION: VALUE)."
  (insert
   (format
    "#+%s: %s\n"
    option
    value)))
#+end_src

**** Removing RESULT blocks

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org-remove-all-results-blocks ()
  "Removes all result blocks; basically an alias"
  (interactive)
  (org-babel-remove-result-one-or-many t))
#+end_src
**** Test for presence of tag

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org-mode--has-tag-p (tag)
  "Return t if TAG is a member of the tags of the entry at point."
  (member
   tag
   (org-get-tags)))
#+end_src

*** Lint

Use [[github:/amperser/proselint][Proselint]].

#+begin_src emacs-lisp
(after! org
  :config
  (flycheck-reset-enabled-checker 'proselint))
#+end_src

*** Appearance
#+begin_src emacs-lisp :tangle config-personal.el
(after! org
  (setq
   org-ellipsis " ▾"
   org-hide-leading-stars t))
#+end_src

*** TODO Behavior

TODO Explain

#+begin_src emacs-lisp :tangle config-personal.el
(after! org
  (setq org-refile-targets '((nil :maxlevel . 9)
                             (org-agenda-files :maxlevel . 9))
        org-startup-folded t
        org-log-repeat nil))
#+end_src

**** TODOs
***** Priorities

I use a numeric scale for priorities rather than the default =A= through =C=.

#+begin_src emacs-lisp :tangle config-personal.el
(after! org
  :config
  (setq
   org-priority-highest 0
   org-priority-default 2
   org-priority-lowest 4))
#+end_src

***** Keywords

#+begin_src emacs-lisp :tangle config-personal.el
(after! org
  :config
  (setq
   org-todo-keywords
   '((sequence
      ;; A task that needs doing & is ready to do
      "TODO(t)"
      ;; A project, which usually contains other tasks
      "PROJ(p)"
      ;; A task that is in progress
      "INPROGRESS(i)"
      ;; Something external is holding up this task
      "BLOCKED(b)"
      ;; This task is paused/on hold because of me
      "HOLD(h)"
      "|"
      ;; Task successfully completed
      "DONE(d)"
      ;; Task was moved
      "MOVE(m)"
      ;; Task was cancelled, aborted or is no longer applicable
      "KILL(k)")
     (sequence
      ;; A task that needs doing
      "[ ](T)"
      ;; Task is in progress
      "[-](S)"
      ;; Task is being held up or paused
      "[?](W)"
      "|"
      ;; Task was completed
      "[X](D)"))
   org-todo-keyword-faces
   '(("[-]"  . +org-todo-active)
     ("INPROGRESS" . +org-todo-active)
     ("[?]"  . +org-todo-onhold)
     ("BLOCKED" . +org-todo-onhold)
     ("HOLD" . +org-todo-onhold)
     ("PROJ" . +org-todo-project))))
#+end_src

***** When marking a heading as ...

Save the buffer whenever I make change the state of a todo item. Note: The buffer [[https://emacs.stackexchange.com/questions/55899/how-to-save-a-org-buffer-everytime-the-todo-state-changes#comment87667_55900][will appear modified even after running this snippet]].

#+begin_src emacs-lisp :tangle config-personal.el
;; (after! org
;;   (add-hook!
;;    'org-after-todo-state-change-hook
;;    'save-buffer))
#+end_src

****** =INPROGRESS=

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org-mode-when-inprogress ()
  "Handle inprogress behavior."
  ;; Intentionally disabled for the moment. Leave the method here for reference.
  ;; (cond ((string-equal
  ;;         (org-get-todo-state)
  ;;         "INPROGRESS")
  ;;        (org-clock-in)
  ;;        ))
  )

(after! org
  :config
  (add-hook!
   'org-after-todo-state-change-hook
   'cashweaver/org-mode-when-inprogress))
#+end_src

****** Done

Record the current time when marking a heading as done.

#+begin_src emacs-lisp :tangle config-personal.el
(after! org
  :config
  (setq
   org-log-done 'time))
#+end_src

There are three types of actions which can occur when I mark a TODO item as done. They have a precedence and I've listed them in that order.

1. =noop=: The item remains in the same file; nothing happens other than the todo state changing.
2. =cut=: Delete the item.
2. =archive= (default action): Delete and archive the item.

The return value of hooks determine the action we take. All =noop= hooks must return nil before we consider cutting the entry. Likewise, all =cut= hooks must return nil before we archive the entry.

#+begin_src emacs-lisp :tangle config-personal.el
(defcustom cashweaver/org-mode-done-noop-hook
  nil
  "Functions which are non-nil when we should noop the TODO at point."
  :type 'hook)

(defcustom cashweaver/org-mode-done-cut-hook
  nil
  "Functions which are non-nil when we should cut the TODO at point."
  :type 'hook)
#+end_src

#+RESULTS:

******* Tag

******** =noop=

#+begin_src emacs-lisp :tangle config-personal.el
(defcustom cashweaver/org-mode-noop-tag
  "noop"
  "Tag which, when present, indicates that the TODO item should be noop.")

(defun cashweaver/org-mode--has-noop-tag-p ()
  (cashweaver/org-mode--has-tag-p
   cashweaver/org-mode-noop-tag))

(add-hook
 'cashweaver/org-mode-done-noop-hook
 'cashweaver/org-mode--has-noop-tag-p)
#+end_src

#+RESULTS:
| cashweaver/org-mode--has-noop-tag-p |

******** =cut=

#+begin_src emacs-lisp :tangle config-personal.el
(defcustom cashweaver/org-mode-cut-tag
  "cut"
  "Tag which, when present, indicates that the TODO item should be cut.")

(defun cashweaver/org-mode--has-cut-tag-p ()
  (cashweaver/org-mode--has-tag-p
   cashweaver/org-mode-cut-tag))

(add-hook
 'cashweaver/org-mode-done-cut-hook
 'cashweaver/org-mode--has-cut-tag-p)
#+end_src

******* File

******** =noop=
#+begin_src emacs-lisp :tangle config-personal.el
(defcustom cashweaver/org-mode--done-noop-file-paths
  nil
  "TODOs in these files will be noop by default.")

(defun cashweaver/org-mode--done-in-noop-file-p ()
  (member
   buffer-file-name
   cashweaver/org-mode--done-noop-file-paths))

(add-hook
 'cashweaver/org-mode-done-noop-hook
 'cashweaver/org-mode--done-in-noop-file-p)
#+end_src

******** =cut=
#+begin_src emacs-lisp :tangle config-personal.el
(defcustom cashweaver/org-mode--done-cut-file-paths
  nil
  "TODOs in these files will be cut by default.")

(defun cashweaver/org-mode--done-in-cut-file-p ()
  (member
   buffer-file-name
   cashweaver/org-mode--done-cut-file-paths))

(add-hook
 'cashweaver/org-mode-done-cut-hook
 'cashweaver/org-mode--done-in-cut-file-p)
#+end_src

******* State
******** Repeating

#+begin_src emacs-lisp :tangle config-personal.el
(add-hook
 'cashweaver/org-mode-done-noop-hook
 (lambda ()
   (org-get-repeat)))
#+end_src
******** =KILL=

#+begin_src emacs-lisp :tangle config-personal.el
(add-hook
 'cashweaver/org-mode-done-cut-hook
 (lambda ()
   (string=
    org-state
    "KILL")))
#+end_src

