config/doom/config-personal.org
**** TODO Roam

I use =org-roam= for [[github:cashweaver/roam][general]] and private notes. Each roam directory contains a =.dir-locals.el= file which configures things like capture templates and =before-save-hook=.

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org-set-last-modified ()
  (interactive)
  (when (derived-mode-p 'org-mode)
    (save-excursion
      (goto-char
       (point-min))
      (org-set-property
       "LAST_MODIFIED"
       (cashweaver/format-time
        "[%Y-%m-%d %a %H:%M]")))))

;; (after! org
;;   (add-hook!
;;     'before-save-hook
;;     (cashweaver/org-set-last-modified)))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(add-hook
 'cashweaver/org-mode-done-cut-hook
 'org-roam-file-p)
#+end_src

#+RESULTS:
| org-roam-file-p | (lambda nil (string= org-state KILL)) | cashweaver/org-mode--done-in-cut-file-p | cashweaver/org-mode--has-cut-tag-p |

#+begin_src emacs-lisp :tangle config-personal.el
(defvar
  cashweaver/org-roam--file-path-exceptions-to-export-after-save
  '()
  "List of org-roam file paths which should NOT be exported after they are saved. This list is populated within the particular .dir-local.el files.")

(defvar
  cashweaver/org-roam--file-path-exceptions-to-mirror-refs-to-front-matter
  '()
  "List of org-roam file paths which should NOT have references mirrored to front matter. This list is populated within the particular .dir-local.el files.")
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(defun cashweaver/org-hugo-export-wim-to-md ()
  "Function for `after-save-hook' to run `org-hugo-export-wim-to-md'.

The exporting happens only when Org Capture is not in progress."
  (interactive)
  (when (and
         (not
          (eq real-this-command 'org-capture-finalize))
         (not
          (member
           (buffer-file-name)
           cashweaver/org-roam--file-path-exceptions-to-export-after-save)))
    (save-excursion
      (let* ((org-id-extra-files
              (org-roam-list-files))
             (export-file-path
              (org-hugo-export-wim-to-md)))
        (when cashweaver/org-hugo-replace-front-matter-with-title
          (with-current-buffer
              (find-file-noselect
               export-file-path)
            (cashweaver/replace-toml-front-matter-with-md-heading)
            (save-buffer)))))))

(after! org-roam
  (defun org-hugo-export-wim-to-md-after-save ()
    (cashweaver/org-hugo-export-wim-to-md)))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! org-roam
  :after org
  :config
  (setq
   cashweaver/org-hugo-replace-front-matter-with-title nil))

(defun cashweaver/org-roam-rewrite-smart-to-ascii ()
  (when (org-roam-file-p)
    (cashweaver/replace-smart-quotes-in-buffer)))

(defun cashweaver/org-roam--get-filetags (&optional node-id)
  "Return a list of all tags used in roam.

Optionally: Exclude tags currently in use in the provided NODE-ID."
  (if node-id
      (org-roam-db-query
       [:select :distinct [tag]
        :from tags
        :where tag :not-in [:select tag
                            :from tags
                            :where (= node_id $s1)]]
       node-id)
    (org-roam-db-query
     [:select :distinct tag
      :from tags])))

;; TODO
(defun cashweaver/org-roam--get-all-drafts ()
  "Return a list of nodes which are marked as drafts.")

(defun cashweaver/org-roam--set-filetag (&optional node-id)
  "Add a filetag in the current file."
  (let ((tag
         (completing-read
          "Select tag: "
          (cashweaver/org-roam--get-filetags node-id)
          )))
    (cashweaver/org-mode-set-filetag tag)))

;;(org-roam-db-query "SELECT DISTINCT tag FROM tags;")
;; "007bbe54-0e36-4af5-b2ec-cf7762299a1f"

;; (let ((current-file-id "6a214828-bea5-47be-bac7-0f0235b0ff3c"))
;;   (org-roam-db-query
;;    [:select :distinct [tag]
;;     :from tags
;;     :where (= node_id $s1)]
;;    current-file-id))

;; (let ((current-file-id "6a214828-bea5-47be-bac7-0f0235b0ff3c"))
;;   (org-roam-db-query
;;    (format
;;     ;; "SELECT DISTINCT tag
;;     ;; FROM tags
;;     ;; WHERE NOT IN (
;;     ;; SELECT tag
;;     ;; FROM tags
;;     ;; WHERE node_id = '\"%s\"'
;;     ;; )"
;;     "SELECT DISTINCT tag
;; FROM tags
;; WHERE node_id = '\"%s\"'"
;;     current-file-id)))
;; (let ((current-file-id "6a214828-bea5-47be-bac7-0f0235b0ff3c"))
;;   (org-roam-db-query
;;    [:select :distinct [tag]
;;     :from tags
;;     :where tag :not-in [:select tag
;;                         :from tags
;;                         :where (= node_id $s1)]]
;;    current-file-id))


(defun cashweaver/org-roam-make-filepath (title &optional time time-zone)
  "Return a filenaem for an org-roam node.

Reference: https://ag91.github.io/blog/2020/11/12/write-org-roam-notes-via-elisp"
  (let ((slug
         (org-roam-node-slug
          (org-roam-node-create
           :title title))))
    (format
     "%s/%s.org"
     org-roam-directory
     slug)))

(defun cashweaver/org-mode-add-option (option value)
  "Add another option; requires at least one option to already be present.

TODO: move to org-mode section"
  (goto-char
   (point-max))
  (insert "foo")
  (when (search-backward-regexp
         "#\\+[A-Za-z_]+:"
         ;; bound
         nil
         ;; noerror
         t)
    (cashweaver/org-mode-insert-option
     option
     value)))

(defun cashweaver/org-mode-insert-option (option value)
  "Insert an org-mode option (#+OPTION: VALUE).

TODO: move to org-mode section"
  (insert
   (format
    "#+%s: %s\n"
    option
    value)))

(defun cashweaver/org-mode-insert-options (options)
  "Insert an alist of org-mode options (#+OPTION: VALUE)."
  (cl-loop for (option . value) in options
           do (cashweaver/org-mode-insert-option
               option
               value)))

(defun cashweaver/org-mode-insert-property (property value)
  "Insert an org-mode property (:PROPERTY: VALUE)."
  (insert
   (format
    ":%s: %s\n"
    property
    value)))

(defun cashweaver/org-mode-insert-properties (properties)
  "Insert an alist of org-mode properties (:PROPERTY: VALUE).

When WRAP is non-nil: Wrap the properties with :PROPERTIES:/:END:."
  (interactive)
  (cl-loop for (property . value) in properties
           do (org-set-property
               property
               value)))

(defun cashweaver/org-roam-new-node (file-path title &optional properties)
  "Build a new org-roam node in a temp file.

PROPERTIES is expected to be an alist of additional properties to include.

Reference: https://ag91.github.io/blog/2020/11/12/write-org-roam-notes-via-elisp"
  (let* ((id
          (org-id-new))
         (created-date
          (cashweaver/format-time
           "[%Y-%m-%d %a %H:%M]"))
         (all-properties
          (append
           `(("ID" . ,id))
           properties)))
    (with-temp-file
        file-path
      (cashweaver/org-mode-insert-properties
       all-properties)
      (goto-char
       (point-max))
      (cashweaver/org-mode-insert-options
       `(("TITLE" . ,title)
         ("AUTHOR" . "Cash Weaver")
         ("DATE" . ,created-date)
         ("HUGO_AUTO_SET_LASTMOD" . "t")))
      (insert "")
      (org-insert-heading)
      (insert
       "TODO Summary")
      (org-insert-heading)
      (insert
       "TODO Notes")
      (org-insert-heading)
      (insert
       "TODO Thoughts"))))

(defun cashweaver/org-roam-new-node-from-link-heading-at-point (&optional mark-as-done)
  "Build a new org-roam node from the link heading at point."
  (interactive)
  (let* ((link
          (org-element-context))
         (type
          (org-element-property
           :type
           link))
         (url
          (org-element-property
           :raw-link
           link))
         (description
          (cashweaver/org-mode-get-description-from-link-at-point))
         (org-roam-node-file-path
          (cashweaver/org-roam-make-filepath description)))
    ;; TODO Replace with regexp?
    (unless (or (string= type "http")
                (string= type "https")))
    (cashweaver/org-roam-new-node
     org-roam-node-file-path
     description
     `(("ROAM_REFS" . ,url)))
    (if mark-as-done
        (org-todo "DONE"))
    (find-file
     org-roam-node-file-path)))

(defun cashweaver/org-mode-get-description-from-link-at-point ()
  "Reference: https://emacs.stackexchange.com/a/38297"
  (interactive)
  (let ((link
         (org-element-context)))
    (message
     "%s"
     (buffer-substring-no-properties
      (org-element-property
       :contents-begin
       link)
      (org-element-property
       :contents-end
       link)))))


(defun cashweaver/org-roam-open-ref ()
  "Open the ROAM_REF."
  (interactive)
  (let ((roam-refs
         (org-entry-get
          (point)
          "ROAM_REFS")))
    (message roam-refs)
    (if (s-starts-with-p
         "http"
         roam-refs)
        (browse-url roam-refs)
      (message
       "Not an http(s) ref (%s)"
       roam-refs))))


;; This bit is no longer necessary as I've discovered .dir-locals.el.
;; Setting `org-attach-directory' in .dir-locals.el has the desired
;; effect of this function.
;;
;; (defun cashweaver/org-roam-insert-attachment-path ()
;;   (let ((dir
;;          (format
;;           "%s/%s"
;;           cashweaver/org-roam-attachment-base-path
;;           (org-id-get))))
;;     (save-excursion
;;       (org-set-property
;;        "DIR"
;;        dir))))
;; (after! org-roam
;;   (remove-hook! 'org-roam-capture-new-node-hook
;;               'cashweaver/org-roam-insert-attachment-path))

(defun cashewaver-org-roam--append-to-custom-front-matter (key value)
  "Append the provided KEY and VALUE to hugo_custom_front_matter."
  (when (org-roam-file-p)
    (let
        ((keyword
          "HUGO_CUSTOM_FRONT_MATTER")
         (current-value
          (org-collect-keywords
           keyword)))
      (message current-value)
      (org-roam-set-keyword
       (downcase keyword)
       (format "%s %s"
               key
               value)))))

(defun cashweaver/org-roam--mirror-roam-aliases-to-hugo-aliases ()
  "Copy the list of ROAM_ALIASES into HUGO_ALIASES.

Work in progress"
  (interactive)
  (when (org-roam-file-p)
    (when-let*
        ((option
          "HUGO_ALIASES")
         (raw-roam-aliases
          (read (format "(%s)"
                        (org-export-get-node-property
                         :ROAM_ALIASES
                         (org-element-parse-buffer)))))
         (roam-aliases
          (mapcar
           #'downcase
           (mapcar
            (lambda (alias)
              (replace-regexp-in-string
               " "
               "_"
               alias))
            raw-roam-aliases))))
      ;;roam-aliases
      roam-aliases
      )))

;; (cashweaver/org-roam--mirror-roam-aliases-to-hugo-aliases)

(defun cashweaver/org-roam--mirror-roam-aliases-to-hugo-aliases ()
  "Copy the list of ROAM_ALIASES into HUGO_ALIASES."
  (interactive)
  (when (org-roam-file-p)
    (when-let
        ((option
          "HUGO_ALIASES")
         (raw-roam-aliases
          (org-export-get-node-property
            :ROAM_ALIASES
            (org-element-parse-buffer))))
      (message raw-roam-aliases))))

(defun cashweaver/org-roam--process-ref-before-adding-to-front-matter (ref)
  (cond
   ((string-match-p "^\\[cite" ref)
    nil
    ;; (let ((citation
    ;;        (save-excursion
    ;;          (beginning-of-buffer)
    ;;          (search-forward ref)
    ;;          (org-element-citation-parser))))
    ;;   (org-cite-export-citation
    ;;    citation
    ;;    nil
    ;;    '(:cite-export nil)
    ;;    ))
    )
   (t
    ref)))

(defun cashweaver/org-roam-mirror-roam-refs-to-front-matter ()
  "Copy the list of ROAM_REFS into hugo_custom_front_matter."
  (interactive)
  (when (and (org-roam-file-p)
             (not (member
                   (buffer-file-name)
                   cashweaver/org-roam--file-path-exceptions-to-mirror-refs-to-front-matter)))
    (when-let*
        ((keyword
          "HUGO_CUSTOM_FRONT_MATTER")
         (raw-roam-refs
          (org-export-get-node-property
           :ROAM_REFS
           (org-element-parse-buffer)))
         (refs
          (split-string
           raw-roam-refs
           " +"))
         (valid-refs
          (-filter
           (lambda (ref)
             (not (string-match-p "^\\[cite" ref)))
           refs))
         (roam-refs
          (format
           "roam_refs '(%s)"
           (string-join
            (mapcar
             (lambda (ref)
               (format "\"%s\""
                       ref))
             valid-refs)
            " ")))
         (current-roam-refs
          (or
           (org-roam-get-keyword
            keyword)
           "")))
      (if (not (string=
                roam-refs
                current-roam-refs))
          (org-roam-set-keyword
           (downcase keyword)
           roam-refs)))))

(defun cashweaver/citation-present-in-buffer-p ()
  "Return true if a citation is present in the current buffer, nil otherwise."
  (let ((citation-prefix
         "[cite"))
    (save-excursion
      (goto-char
       (point-min))
      (search-forward
       citation-prefix
       ;; bound
       nil
       ;; no-error
       t))))

(defcustom cashweaver/org-roam--file-path-exceptions-to-add-bibliography
  '()
  "File paths which will not have a bibliography added by `cashweaver/org-roam-add-bibliography'.")

(defun cashweaver/org-roam-add-bibliography (&optional skip-if-present)
  "Add #+print_bibiliography to the current buffer."
  (interactive)
  (when (and (org-roam-file-p)
             (not
              (member
               (buffer-file-name)
               cashweaver/org-roam--file-path-exceptions-to-add-bibliography))
             (cashweaver/citation-present-in-buffer-p))
    (let* ((skip-if-present
            (or skip-if-present
                t))
           (bibliography-option
            "#+print_bibliography:")
           (bibliography-present-in-buffer
            (save-excursion
              (goto-char
               (point-min))
              (search-forward
               bibliography-option
               ;; bound
               nil
               ;; noerror
               t))))
      (unless (and skip-if-present
                   bibliography-present-in-buffer)
        (save-excursion
          (goto-char
           (point-min))
          (cond
           ((search-forward
             "Anki :noexport:"
             ;; bound
             nil
             ;; noerror
             t)
            (previous-line)
            (end-of-line)
            (newline))
           (t
            (goto-char
             (point-max))))
          (insert
           bibliography-option))))))

(defcustom cashweaver/org-roam--file-path-exceptions-to-add-anki
  '()
  "File paths which will not have a bibliography added by `cashweaver/org-roam-add-anki'.")

(defun cashweaver/anki-available-p ()
  (condition-case error
      (anki-editor-api-check)
    ('error
     nil))
  t)

(defun cashweaver/enable-anki-editor-mode ()
  (if (cashweaver/anki-available-p)
      (anki-editor-mode t)
    (message "Skipping enable anki-editor-mode because Anki isn't available.")))

(defun cashweaver/anki-editor-push-notes ()
  (if (cashweaver/anki-available-p)
      (anki-editor-push-notes)
    (message "Skipping anki-editor-push-notes because Anki isn't available.")))

(defun cashweaver/org-roam-add-anki (&optional skip-if-present)
  "Add Anki heading to the current buffer."
  (interactive)
  (when (cashweaver/anki-available-p)
    (let ((skip-if-present
           (or skip-if-present
               t))
          (anki-header-regexp
           (rx
            "*"
            (or " TODO"
                "")
            (or (and " \[#"
                     (any "0" "1" "2" "3" "4")
                     "\]")
                "")
            " Anki")
           )
          (is-valid-file
           (and (org-roam-file-p)
                (not
                 (member
                  (buffer-file-name)
                  cashweaver/org-roam--file-path-exceptions-to-add-anki)))))
      (when is-valid-file
        (let* ((anki-present-in-buffer
                (save-excursion
                  (goto-char
                   (point-min))
                  (re-search-forward
                   anki-header-regexp
                   ;; bound
                   nil
                   ;; noerror
                   t))))
          (unless (and skip-if-present
                       anki-present-in-buffer)
            (save-excursion
              (goto-char
               (point-max))
              (org-insert-heading
               ;; arg
               nil
               ;; invisible-ok
               t
               ;; top
               t
               )
              (insert "TODO [#2] Anki")
              (org-set-tags '("noexport"))
              (org-set-property
               "ANKI_DECK"
               "Default"))))))))

(defun run-function-in-file (filepath function &optional arguments)
  (let ((args (or arguments
                  nil)))
    (save-excursion
      (find-file filepath)
      (apply function arguments)
      (write-file filepath)
      (kill-buffer (current-buffer)))))

(defun cashweaver/org-hugo-export-all (directory)
  (mapc (lambda (filepath)
          (run-function-in-file
           filepath
           'cashweaver/org-hugo-export-wim-to-md))
        (directory-files
         directory
         ;; full
         t
         ;; match
         ".org$")))

(defun cashweaver/org-roam-set-filetag ()
  "Set the filetag option based on org-roam tags."
  (interactive)
  (when (org-roam-file-p)
    (let ((node-id (org-roam-node-id
                    (org-roam-node-at-point))))
      (cashweaver/org-roam--set-filetag
       node-id))))

(defun cashweaver/org-roam-insert-tag-link ()
  "Insert a link to the selected tag"
  (interactive)
  (let ((tag
         (completing-read
          "Select tag: "
          (cashweaver/org-roam--get-filetags)
          )))
    (insert
     (format "[[/tags/%s][%s]]"
             (downcase
              (nth 0
                   (org-hugo--tag-processing-fn-replace-with-hyphens-maybe
                    `(,tag)
                    `(:hugo-prefer-hyphen-in-tags ,org-hugo-prefer-hyphen-in-tags))))
             tag))))


(defun cashweaver/org-roam-node-from-cite (keys-entries)
  "Create a roam node based on bibliography citation.

See: https://jethrokuan.github.io/org-roam-guide"
  (interactive (list (citar-select-ref
                      :multiple nil
                      :rebuild-cache t)))
  (let* ((author
          (citar--format-entry-no-widths
           (cdr keys-entries)
           "${author editor journal}"))
         (citation-title
          (citar--format-entry-no-widths
           (cdr keys-entries)
           "${title}"))
         (source-url
          (citar--format-entry-no-widths
           (cdr keys-entries)
           "${howpublished}"))
         (node-title
          (cond
           ((and
             (not (string-empty-p citation-title))
             (not (string-empty-p author)))
            (s-format
             "${author} | ${title}"
             'aget
             `(("author" . ,author)
               ("title" . ,citation-title))))
           ((string-empty-p author)
            citation-title)
           ((string-empty-p citation-title)
            "Something went wrong when extracting the title.")
           (t
            "Something went wrong when parsing the citation."))))

    (org-roam-capture- :templates
                       '(("r" "reference" plain "%?" :if-new
                          (file+head "${citekey}.org"
                                     ":PROPERTIES:
:ROAM_REFS: [cite:@${citekey}]
:END:
,#+title: ${title}\n
,#+author: Cash Weaver\n
,#+date: [%<%Y-%m-%d %a %H:%M>]\n
,#+filetags: :reference:\n
 \n
TODO_AUTHOR, [cite:@${citekey}]\n
 \n
,* TODO Summary\n
,* TODO Thoughts\n
,* TODO Notes\n")
                          :immediate-finish t
                          :unnarrowed t))
                       :info (list :citekey (car keys-entries))
                       :node (org-roam-node-create :title node-title)
                       :props '(:finalize find-file))))

(defun cashweaver/org-roam-before-save ()
  (cashweaver/org-roam-rewrite-smart-to-ascii)
  (cashweaver/org-roam-mirror-roam-refs-to-front-matter)
  (cashweaver/org-roam-add-bibliography)
  (cashweaver/org-roam-add-anki)
  (cashweaver/anki-editor-push-notes))
#+end_src

#+RESULTS:
: cashweaver/org-roam-before-save

#+begin_src emacs-lisp
(cashweaver/org-hugo-export-all
 (format "%s/proj/roam"
         cashweaver/home-dir-path))
#+end_src


