config/doom/config-personal.org
** TOML

#+begin_src emacs-lisp :tangle packages-personal.el
(package! toml
  :recipe (:host github
           :repo "gongo/emacs-toml"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! toml)
#+end_src

#+begin_src emacs-lisp
;; (yaml-parse-string "
;; title = \"this is the title\"
;; draft = false")
(toml:read-from-string "
title = \"this is the title\"
author = [\"cashweaver\"]
date = 2022-02-10T09:33:00-08:00
draft = true")
#+end_src

** =electric-case=
#+begin_src emacs-lisp :tangle packages-personal.el
(package! electric-case
  :recipe (:host github
           :repo "zk-phi/electric-case"))
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
(use-package! electric-case)
#+end_src

#+begin_src emacs-lisp :tangle config-personal.el
;; (add-hook!
;;  'java-mode-hook
;;  'electric-case-java-init)
#+end_src

** roam for all

#+begin_src emacs-lisp
(defun cashweaver/current-buffer-contains-string (target)
  (save-excursion
    (save-match-data
      (goto-char (point-min))
      (search-forward target
                      ;; bound
                      nil
                      ;; noerror
                      t))))

(defun cashweaver/org-roam-resolve-failures ()
  (interactive)
  (when (cashweaver/current-buffer-contains-string "ANKI_FAILURE_REASON: Note was not found")
    (org-map-entries
     (lambda ()
       (org-delete-property
        "ANKI_NOTE_ID"))
     "+ANKI_FAILURE_REASON={Note was not found.*}")))


(defun cashweaver/org-roam-push-anki-notes ()
  (interactive)
  (let* ((org-hugo-auto-set-lastmod nil)
         (org-roam-directory cashweaver/roam-dir-path)
         (org-roam-files (split-string
                          (shell-command-to-string
                           (s-lex-format
                            "cd ${org-roam-directory}; grep -rl \":ANKI_DECK:\""))))
         (progress-reporter (make-progress-reporter "Pushing anki notes"
                                                    0
                                                    (length org-roam-files)))
         (i 0))
    (org-hugo-auto-export-mode)
    (mapcar
     (lambda (file)
       (org-roam-with-file file nil
         (let ((inhibit-message t))
           ;; (anki-editor-push-notes)
           ;; (cashweaver/org-roam-resolve-failures)
           (anki-editor-push-notes)
           (save-buffer))
         (progress-reporter-update progress-reporter
                                   i)

         (setq
          i (+ i 1))))
     org-roam-files)
    (progress-reporter-done progress-reporter)))

#+end_src

#+RESULTS:
: cashweaver/org-roam-push-anki-notes

** Roam: export all

#+begin_src emacs-lisp
(defun cashweaver/org-roam-export-hugo ()
  (interactive)
  (let* ((org-hugo-auto-set-lastmod nil)
         (org-roam-directory cashweaver/roam-dir-path)
         (org-roam-files (org-roam-list-files))
         (count-org-roam-files (length org-roam-files))
         (progress-reporter (make-progress-reporter "Exporting roam notes"
                                                    0
                                                    (length org-roam-files)))
         (expected-seconds-per-file 1.43
                                    ;; Determined by timing the export of 100 files.
                                    )
         (expected-total-run-time (seconds-to-string (* expected-seconds-per-file
                                                        count-org-roam-files)))
         (prompt (s-lex-format "${count-org-roam-files} found. Export expected to take ${expected-total-run-time}. Continue? "))
         (should-export (y-or-n-p prompt))
         (i 0))
    (when should-export
      ;; Enable hugo auto-export mode
      (org-hugo-auto-export-mode)
      ;; Disable anki-editor-mode
      (anki-editor-mode t)
      (mapcar
       (lambda (file)
         (org-roam-with-file file nil
           (let ((inhibit-message t))
             (goto-char
              (point-max))
             (newline)
             (save-buffer))
           (progress-reporter-update progress-reporter
                                     i)
           (setq
            i (+ i 1))))
       org-roam-files)
      (progress-reporter-done progress-reporter))))
#+end_src

#+RESULTS:
: cashweaver/org-roam-export-hugo

* Footnotes

[fn:1] [[github:zzamboni/dot-doom/blob/master/doom.org][Diego Zamboni]], [[https://sachachua.com/dotemacs/][Sacha Chua]], [[https://tecosaur.github.io/emacs-config/config.html][tecosaur]]
