config/doom/packages-personal.el

(package! electric-case
  :recipe (:host github
           :repo "zk-phi/electric-case"))
